import pytest

from task1 import analyse


def test_input_params():
    with pytest.raises(TypeError):
        analyse([
            '1', 2, '3', 4
        ])


def test_accuracy():
    assert analyse([
            ('принять', 46),
            ('выгрузить', 46),
            ('принять', 21),
            ('выгрузить', 21),
        ]) == 4
    assert analyse([
            ('принять', 45),
            ('принять', 46),
            ('выгрузить', 46),
            ('принять', 21),
            ('выгрузить', 21),
        ]) == 5
    assert analyse([
            ('принять', 1),
            ('принять', 2),
            ('выгрузить', 1),
            ('принять', 3),
            ('принять', 4),
            ('выгрузить', 3),
        ]) == 6
    assert analyse([
            ('принять', 1),
            ('принять', 2),
            ('выгрузить', 1),
            ('выгрузить', 2),
            ('принять', 3),
            ('принять', 4),
            ('выгрузить', 3),
        ]) == 9
    assert analyse([
            ('принять', 1),
            ('принять', 2),
            ('выгрузить', 1),
            ('выгрузить', 2),
            ('принять', 3),
            ('принять', 4),
            ('выгрузить', 3),
            ('выгрузить', 4),
        ]) == 12
